<template>
  <div class="content-container">
    <h2 class="sub-title">
      全品AI教研云隐私政策
    </h2>
    <div class="theme-block" />
    <div class="section-item">
      <h3 class="item-title">
        更新日期：2024年3月20日
      </h3>
      <h3 class="item-title">
        生效日期：2024年3月27日
      </h3>
      <h3 class="item-title">
        版本号：V1.0
      </h3>
      <p class="item-text" />
      <p class="item-text" />
    </div>
    <div class="section-item">
      <h3 class="item-title" />
      <p class="item-text">
        北京全品文教科技有限公司（注册地址：武汉市洪山区文化大道路555号融科智谷工业项目（三期）C2号楼2单元三层312-21号房，联系方式：027-65526513，以下简称<span
          class="span_bold"
        >“我们”</span>）系全品AI教研云的运营者。我们非常重视保护用户（以下简称<span
          class="span_bold"
        >“您”
        </span>
        ）的个人信息和隐私。您在使用全品AI教研云时，我们会处理您的相关个人信息。为充分说明我们处理您个人信息的情况，我们特制定《全品AI教研云隐私政策》（以下简称<span
          class="span_bold"
        >“本隐私政策” </span>或<span class="span_bold">“本政策” </span>），我们承诺严格按照本隐私政策处理您的个人信息。
      </p>
      我们在此提醒您：
      <p class="item-text">
        本隐私政策适用于我们通过全品AI教研云（包括但不限于APP、公众号、小程序、网站、快应用以及随技术发展出现的新形态）向您提供的产品或服务（统称“服务”）所收集的信息。如全品AI教研云中的特定服务有单独的个人信息处理规则，则该单独规则优先适用，该规则未涵盖的内容，以本隐私政策为准。但是，本政策不适用于接入全品AI教研云的第三方所收集的信息；如您使用第三方提供的服务，则您须受其隐私政策（而非本政策）的约束。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        本隐私政策将帮助您了解以下内容：
      </h3>

      <p class="item-text">
        一、我们如何收集您的个人信息
      </p>
      <p class="item-text">
        二、我们如何使用您的个人信息
      </p>
      <p class="item-text">
        三、我们如何存储您的个人信息
      </p>
      <p class="item-text">
        四、我们如何委托处理、对外提供、转移、公开披露您的个人信息
      </p>
      <p class="item-text">
        五、我们如何保护您的个人信息
      </p>
      <p class="item-text">
        六、您如何管理个人信息
      </p>
      <p class="item-text">
        七、我们如何处理未成年人的信息
      </p>
      <p class="item-text">
        八、本隐私政策如何更新
      </p>
      <p class="item-text">
        九、如何联系我们
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        一、我们如何收集您的个人信息
      </h3>
      <h3 class="item-title">
        （一）收集个人信息的场景
      </h3>
      <p class="item-text">
        在您使用全品AI教研云的过程中，我们会按照如下方式收集您的个人信息：
      </p>
      <p class="item-text">
        1.账号注册/登录
        当您注册全品AI教研云时，您需要向我们提供您的手机号码。我们收集您的上述信息是为了帮助您完成全品AI教研云账户的注册，保护您的账户安全。如您不提供这类信息，我们将无法为您创建账户并正常向您提供服务。
        当您使用第三方账户（如微信账户）关联登录全品AI教研云时，我们将通过该等第三方收集您的OpenID。如您不提供这类信息，您将无法通过第三方账户注册、登录全品AI教研云。
      </p>
      <p class="item-text">
        2.填写申请信息
        当您使用填写申请信息时，您需要向我们提供您的姓名、手机号、QQ/微信、单位名称、单位类型、所在地区、意向服务、具体需求。我们收集您的上述信息是为了核实您的真实身份并与您取得联系。如不收集这类信息，我们将因无法验证您的真实身份，无法正常向您提供开放服务，但不影响您正常使用我们的其他服务。
      </p>
      <p class="item-text">
        3.保障网络和服务的安全稳定
        为了保障网络和服务的安全稳定运行，我们会收集您的IP地址、访问日期和时间。我们收集您的上述信息是为了保障您在访问我们网络时的安全性和稳定性降低您在使用我们的服务时的安全风险，保障网络访问以及产品和服务的稳定运行。您不提供上述信息，则我们无法保证您在使用期间的应用运行安全。
      </p>
      <p class="item-text">
        4.客户服务
        在您向我们提出投诉、建议或进行问题反馈时，为便于与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果，我们可能会收集您与我们的通信或通话记录、您提供的账号信息、您提供的联系方式信息、您为了证明相关事实提供的信息。如您不提供这类信息，您的投诉、建议和反馈可能无法得到及时、有效处理，但不影响您正常使用我们的其他服务。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        （二）依赖其他合法事由而无需同意的说明
      </h3>
      <p class="item-text">
        根据相关法律规定，在以下情形中，我们处理您的个人信息而无需征得您的同意：
      </p>
      <p class="item-text">
        1.为订立、履行您作为一方当事人的合同所必需；
      </p>
      <p class="item-text">
        2.为履行法定职责或者法定义务所必需；
      </p>
      <p class="item-text">
        3.为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；
      </p>
      <p class="item-text">
        4.为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；
      </p>

      <p class="item-text">
        5.依照法律规定在合理的范围内处理您自行公开或者其他已经合法公开的个人信息；
      </p>
      <p class="item-text">
        6.法律、行政法规规定的其他情形。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        （三）我们如何使用Cookies和同类技术
      </h3>
      <p class="item-text">
        为确保您获得更轻松的访问体验，我们会在您的计算机或移动设备上存储Cookie、Flash
        Cookie，或浏览器（或关联应用程序）提供的其他通常包含标识符、站点名称以及一些号码和字符的本地存储（以上合称“Cookies”）。
        我们使用自己的Cookies或同类技术，可能用于以下用途：
      </p>
      <p class="item-text">
        1、记住您的身份。我们可利用Cookies或同类技术有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供有关您的喜好或其他信息；
      </p>
      <p class="item-text">
        2、分析您使用我们服务的情况。我们可利用Cookies或同类技术来了解您使用服务进行什么活动、或哪些服务最受欢迎；
      </p>
      <p class="item-text">
        3、资源推荐优化。Cookies或同类技术有助于我们根据您的信息，向您提供与您相关的资源推荐而非进行普遍的推荐。
      </p>
      <p class="item-text">
        如果您的浏览器或浏览器附加服务允许，您可修改对Cookies的接受程度或拒绝我们的Cookies。但如果您这么做，在某些情况下可能会影响您安全访问我们的网站，且可能需要在每一次访问我们的网站时更改用户设置。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        二、我们如何使用您的个人信息
      </h3>
      <p class="item-text">
        1.我们仅会按照本隐私政策规定的目的和范围收集和使用您的个人信息。随着我们服务的升级迭代，我们可能会对本隐私政策描述的业务功能及其收集使用的个人信息类型进行调整。当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。
      </p>
      <p class="item-text">
        2.当我们要将您的个人信息用于与原处理目的无直接或合理关联的场景，用于本隐私政策未载明的其他用途时，或基于特定目的收集而来的信息用于其他目的时，我们会通过更新本隐私政策、相关产品页面等隐私文档并通过弹窗、站内信、推送信息等多种方式向您告知，并事先征求您的同意或具备其他合法事由。
      </p>
      <p class="item-text">
        我们收集的敏感个人信息已在本隐私政策中通过显著标识进行展示，一旦您的敏感个人信息被泄露、篡改或被非法使用，将会对您的人身或财产安全造成损害。为防止您的敏感个人信息被泄露或被非法使用，我们已采取适当的技术和组织保护措施，尽力保障您的信息安全。
      </p>
      <p class="item-text">
        4.若您提供的信息中含有他人的个人信息，在向我们提供这些个人信息之前，您需确保您已经取得相关主体的有效同意。若其中涉及儿童个人信息的，您需在提供前取得相应儿童监护人的有效同意，前述情形下监护人有权通过本隐私政策规定的途径联系我们，要求更正或删除涉及儿童个人信息的内容。如您提供的信息侵犯他人的隐私权、个人信息、商业秘密或其他任何合法权益，给国家、社会公共利益或他人造成损害，您应自行承担全部责任，我们对此不承担任何责任。
      </p>
      <p class="item-text">
        5.请您注意，您在使用我们提供的服务时所提供的个人信息，除非您删除或通过系统设置拒绝我们收集，否则将在您使用我们的服务期间持续授权我们使用。
      </p>
      <p class="item-text">
        6.我们会对我们提供的服务使用情况进行统计，并可能会向公众或第三方提供这些统计信息，以用于产品开发、服务优化、安全保障的目的。但这些统计信息不包含您的任何身份识别信息。当我们展示您的个人信息时，我们会根据业务实际功能采用包括掩码、屏蔽等去标识化技术对您的信息进行脱敏，以保护您的信息安全。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        三、我们如何存储您的个人信息
      </h3>
      <h3 class="item-title">
        （一）存储期限
      </h3>
      <p class="item-text">
        我们将在本隐私政策载明的目的所需及法律要求的最短保存期限之内，保存您的个人信息。前述期限届满后，我们将对您的个人信息做删除或匿名化处理。
      </p>
      <h3 class="item-title">
        （二）存储地域
      </h3>
      <p class="item-text">
        我们在中国境内运营中收集和产生的个人信息，存储在中国境内。如需将您的个人信息转移到境外的，我们将在转移前按照关于个人信息出境的法律要求行事。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        四、我们如何委托处理、对外提供、转让、公开披露您的个人信息
      </h3>

      <h3 class="item-title">
        （一）委托处理
      </h3>
      <p class="item-text">
        目前，我们未委托第三方处理您的个人信息。
      </p>
      <p class="item-text">
        未来如我们需要委托其他第三方处理您的个人信息的，我们将在相应页面或通过其他适当方式向您告知相关详细情况，并取得您的单独同意或具备其他合法事由。
      </p>
      <h3 class="item-title">
        （二）对外提供
      </h3>
      <p class="item-text">
        目前，我们不会对外提供您的个人信息。
      </p>
      <p class="item-text">
        未来如我们需要向其他第三方提供您的个人信息的，我们将在相应页面或通过其他适当方式向您告知相关详细情况，并取得您的单独同意或具备其他合法事由。
      </p>
      <h3 class="item-title">
        （三）转移
      </h3>
      <p class="item-text">
        随着业务的发展，我们可能对业务进行并购重组，你的个人信息可能因此而被转移。我们将要求继受方按照法律及本隐私政策继续保护你的个人信息，继受方变更原先的处理目的、处理方式的，我们将要求继受方重新征得你的同意。
      </p>

      <h3 class="item-title">
        （四）公开披露
      </h3>
      <p class="item-text">
        原则上，我们不会公开披露您的个人信息。如确需公开披露您的个人信息，我们会取得您的单独同意或者满足法律规定的其他条件。
      </p>

      <h3 class="item-title">
        五、我们如何保护您的个人信息
      </h3>
      <p class="item-text">
        我们非常重视个人信息安全，并采取一切合理可行的措施，保护您的个人信息：
      </p>
      <p class="item-text">
        1.我们采取了行业通行的数据保护技术与管理措施，例如网络隔离、数据加密、员工访问控制等措施，以防止其遭到未经授权的访问、披露、篡改、丢失或毁坏。
      </p>

      <p class="item-text">
        2.请您知悉，虽然我们将尽力确保或担保您发送给我们的任何信息的安全性，但互联网环境并非百分之百安全，我们亦不对由此产生或与之相关的任何风险、损失承担责任。
      </p>
      <p class="item-text">
        3.在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以应用程序推送、电子邮件、短信、电话等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
      </p>
    </div>

    <div class="section-item">
      <h3 class="item-title">
        六、您如何管理您的个人信息
      </h3>
      <p class="item-text">
        在您使用全品AI教研云，您可以查询、复制、转移、更正、补充、删除您的个人信息，以及行使改变授权同意的范围、注销账号等权利。
      </p>
      <h3 class="item-title">
        （一）查询、复制、转移您的个人信息
      </h3>

      <p class="item-text">
        1.如您希望查询或复制您的个人信息，您可以通过“我的-在线客服”向我们提出查询和复制您个人信息的要求。
      </p>
      <p class="item-text">
        2.请您知悉，不同线上载体的查询路径可能有所不同，您可以根据全品AI教研云相应页面提示进行操作，或者您可以通过本隐私政策载明的方式联系我们予以协助。
      </p>
      <p class="item-text">
        3.若您需要将您的个人信息转移至其他平台、企业或组织，您可以通过本政策提供的联系方式与我们联系。我们将对您的请求进行审核，在符合网信部门规定的条件且在技术可行的前提下，我们将为您提供转移相应个人信息的途径。
      </p>
      <h3 class="item-title">
        （二）更正、补充您的个人信息
      </h3>
      <p class="item-text">
        当您发现我们处理的关于您的个人信息有错误或不完整时，您有权要求我们做出更正或补充。您可以参照我们在“（一）查询、复制、转移您的个人信息”部分说明的路径更正、补充您的个人信息，或通过本隐私政策载明的联系方式与我们联系。
      </p>
      <h3 class="item-title">
        （三）删除您的个人信息
      </h3>
      <p class="item-text">
        在以下情形中，您可以向我们提出删除个人信息的请求：
      </p>
      <p class="item-text">
        1.本政策中声明的处理目的已实现、无法实现或者为实现处理目的不再必要；
      </p>
      <p class="item-text">
        2.基于同意处理您的个人信息，您撤回同意的；
      </p>
      <p class="item-text">
        3.个人信息存储期限已届满；
      </p>
      <p class="item-text">
        4.我们违反法律、行政法规或与您的约定收集、使用、存储、对外提供或公开您的个人信息；
      </p>
      <p class="item-text">
        5.您不再使用我们的服务；
      </p>
      <p class="item-text">
        6.我们停止提供产品或者服务；
      </p>
      <p class="item-text">
        7.法律法规规定的其他情形。
      </p>
      <h3 class="item-title">
        （四）改变您授权同意的范围
      </h3>
      <p class="item-text">
        1.您可以通过添加、删除信息、更改隐私设置、开启或关闭您设备的相应功能、权限以及通过本政策载明的方式与我们联系，以改变同意范围或撤回您的授权。
      </p>
      <p class="item-text">
        2.您可以通过联系我们或按照营销信息中说明的退订方式申请退订，以拒绝接收我们向您发送的营销信息。
      </p>
      <p class="item-text">
        3.请您理解，各个产品或服务往往需要开启部分权限并收集必要的个人信息才能得以实现，当您撤回您的同意时，我们将无法继续为您提供撤回同意所对应的产品或服务，但不会影响此前基于您的授权而开展的个人信息处理服务。
      </p>
      <h3 class="item-title">
        （五）约束自动化决策
      </h3>
      <p class="item-text">
        我们的服务中可能包含自动化决策机制。如果我们通过该等机制做出的决定显著影响您的合法权益，您有权要求我们予以说明，并拒绝我们仅通过该等机制做出决定。
      </p>
      <h3 class="item-title">
        （六）解释说明权
      </h3>
      <p class="item-text">
        如您对我们的个人信息处理规则存在疑问，您可以通过本隐私政策提供的联系方式与我们联系，我们会对有关个人信息处理规则向您进行解释说明。
      </p>
      <h3 class="item-title">
        （七）其他个人信息权利
      </h3>
      <p class="item-text">
        在符合相关法律规定的情况下，您的近亲属可以对您身后的相关个人信息行使上述查阅、复制、更正、删除等权利，但您可以联系我们做出另外的安排。
      </p>
      <h3 class="item-title">
        （八）响应您的上述请求
      </h3>
      <p class="item-text">
        为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在十五日或法律规定的期限内做出答复。
      </p>
      <p class="item-text">
        对于您合理的请求，我们原则上不收取费用。对于那些无端重复、超出合理限度的请求，我们将酌情收取一定成本费用。
      </p>

      <p class="item-text">
        在以下情形中，我们将无法响应您的请求：
      </p>
      <p class="item-text">
        1.与我们履行法律规定的义务相关的；
      </p>

      <p class="item-text">
        2.与国家安全、国防安全直接相关的；
      </p>
      <p class="item-text">
        3.与公共安全、公共卫生、重大公共利益直接相关的；
      </p>
      <p class="item-text">
        4.与刑事侦查、起诉、审判和执行判决等直接相关的；
      </p>
      <p class="item-text">
        5.我们有充分证据表明用户存在主观恶意或滥用权利的；
      </p>
      <p class="item-text">
        6.出于维护用户或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
      </p>
      <p class="item-text">
        7.响应用户的请求将导致用户或其他个人、组织的合法权益受到严重损害的；
      </p>
      <p class="item-text">
        8.涉及商业秘密的。
      </p>
    </div>

    <div class="section-item">
      <h3 class="item-title">
        七、我们如何处理未成年人的个人信息
      </h3>
      <p class="item-text">
        1.我们非常重视对未成年人个人信息的保护。根据相关法律规定，收集、使用未满14周岁的未成年人的个人信息，需由监护人授权同意;收集、使用已满14周岁未满18周岁的未成年人个人信息，可由监护人授权同意或自行授权同意。我们处理儿童个人信息的详情请见《全品AI教研云儿童个人信息处理规则》。
      </p>
      <p class="item-text">
        2.如您为未成年人(尤其是不满14周岁的未成年人)，我们要求您请您的父母或其他监护人仔细阅读本隐私政策，并在征得您的监护人授权同意的前提下使用我们的服务或向我们提供信息，
      </p>
      <p class="item-text">
        3.如您是未成年人的监护人，请您关注您所监护的未成年人是否是在您授权同意之后使用我们的产品或服务。如果您对您所监护的未成年人的个人信息有疑问，请通过本隐私政策载明的方式与我们联系。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        八、本隐私政策如何更新
      </h3>
      <p class="item-text">
        我们的隐私政策可能会适时发生变更。我们会在相关产品页面发布本隐私政策的变更信息。对于重大变更，我们还会提供更为显著的通知（如通过弹窗、站内信等方式），向您说明隐私政策的具体变更内容，并获得您的同意。
      </p>
      <p class="item-text">
        未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。
      </p>
      <p class="item-text">
        本隐私政策所指的重大变更包括但不限于：我们的服务模式发生重大变化；个人信息对外提供、转让或公开披露的情形发生变化；您参与个人信息处理方面的权利及其行使方式发生重大变化；我们的联系方式及投诉渠道发生变化；个人信息安全影响评估报告表明存在高风险时。
        我们还会将本隐私政策的旧版本存档，供您查阅。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        九、如何联系我们
      </h3>
      <p class="item-text">
        1.如果您对本隐私政策或个人信息保护有任何问题，您可以通过以下方式与我们联系：
      </p>
      <p class="item-text">
        个人信息保护负责人联系方式：gaohaifeng@canpoint.cn
      </p>
      <p class="item-text">
        其他联系方式：湖北省武汉市东湖高新区现代光谷世贸中心A栋9层
      </p>
      <p class="item-text">
        2.一般情况下，我们将在十五日或法律规定的期限内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，且在您反馈后我们仍拒绝改进的，您还可以向网信、工信、公安及市监等监管部门进行投诉或举报，或通过向中国湖北省武汉市洪山区有管辖权的法院提起诉讼来寻求解决。
      </p>
    </div>
  </div>
</template>

<script type="text/ecmascript-6">
export default {
  name: 'InfomationAuth'
}
</script>

<style lang="scss" scoped rel="stylesheet/scss">
  @use "@/assets/css/variables" as *;
.top-nav {
  display: none;
}
.content-container {
  margin-top: 40px;
  margin-bottom: 50px;
  .sub-title {
    text-align: center;
    color: $color-text-d;
    font-size: 28px;
  }
  .theme-block {
    width: 30px;
    height: 3px;
    margin: 14px auto 20px;
    background: $color-theme;
  }
  .section-item {
    margin-bottom: 30px;
    .item-title {
      margin-bottom: 20px;
      color: $color-text-d;
      font-weight: 700;
      font-size: $font-size-large;
    }
    .item-text {
      line-height: 24px;
      margin-bottom: 15px;
      &.padding-10 {
        padding-left: 10px;
      }
      &.padding-30 {
        padding-left: 30px;
      }
      &.bottom-0 {
        margin-bottom: 0;
      }
    }
  }
}
.span_bold {
  font-weight: bold;
  color: black;
}
</style>
