<template>
  <div class="content-container">
    <h2 class="sub-title">
      全品AI教研云会员服务协议
    </h2>
    <div class="theme-block" />
    <div class="section-item">
      <h3 class="item-title" />
      <p class="item-text" />
      <p class="item-text" />
    </div>
    <div class="section-item">
      <h3 class="item-title">
        欢迎您使用全品AI教研云会员服务（以下简称为“本服务”）：
      </h3>
      <p class="item-text">
        本协议是武汉全品教育科技有限公司旗下全品AI教研云关于用户成为全品AI教研云会员所订立的协议。在您决定购买会员服务之前，请仔细阅读本协议条款，特别是免除或限制责任的相应条款，并选择接受或不接受。除非您已阅读并接受本协议所有条款，否则您无权使用本服务。
      </p>
      <p class="item-text">
        您对本服务的任何购买等获取行为及登录、下载等任何使用行为，即视为您已阅读并同意本协议的约束。
      </p>
      <p class="item-text">
        全品AI教研云将根据以下协议条款为您提供会员服务。您在享受会员服务时必须完全、严格遵守本会员协议条款。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        一、协议条款的确认和接受
      </h3>
      <p class="item-text">
        1.1
        全品AI教研云根据互联网的发展和中华人民共和国有关法律、法规的变化，不断地完善服务质量并依此修改服务条款。全品AI教研云有权就本协议随时更新，且毋须另行通知。您的权利以及义务的表述、购买程序及会员标准，均以最新的服务条款为准。您如果不同意该条款的修改，并不影响已发生责任及义务的承担；如果您在条款变更后继续访问或使用全品AI教研云，则视为您已经接受对本协议的修改。本协议内容同时包括全品AI教研云可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，用户同样应当遵守。
      </p>
      <p class="item-text">
        1.2
        您在进行注册程序及缴费程序过程中点击相应的接受或同意按钮，即表示您已仔细阅读并完全接受本会员协议下的全部条款。只有您根据提示确认愿意支付相关费用，才能使用该会员服务。如您拒绝支付该费用，则不能使用相关的服务。
      </p>
      <p class="item-text">
        1.3
        对于未明确授权给您的会员服务及其他服务的权利、收益由全品AI教研云或相关权利人所有。
      </p>
      <p class="item-text">
        1.4
        未成年人应在法定监护人指导、监督并经其同意的前提下使用本服务。您一旦购买全品AI教研云提供的会员服务，即视为您是符合中华人民共和国法律规定的具有完全民事权利能力和完全民事行为能力及能够独立承担民事责任的自然人，并了解及完全同意本会员协议的各项内容，以及全品AI教研云对本协议随时所做的任何修改。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        二、风险及责任
      </h3>
      <p class="item-text">
        2.1
        您须对自身在使用全品AI教研云所提供的服务时的一切行为、行动（不论是否故意）负全部责任。
      </p>
      <p class="item-text">
        2.2
        您应自行负责妥善且正确地保管、使用、维护在全品AI教研云申请取得的账户及账户密码。您应对您的账户密码采取必要和有效的保密措施。非全品AI教研云原因致使您账户密码泄漏以及因您保管、使用、维护不当造成损失的，全品AI教研云无须承担与此有关的任何责任。因您保管不善可能导致遭受被盗号或密码失窃，责任由您自行承担。用户使用该账号和密码进行违规、违法操作，全品AI教研云有权在作出告知情况下立即冻结该账号并要求用户按照相关法律、法规规定承担相应责任，告知的方式包括但不限于站内公告、站内信、短信、弹窗等，并可视情况注销您的全品AI教研云账号。
        全品AI教研云账号的所有权归全品AI教研云所有，您完成申请注册手续后，获得全品AI教研云账号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。
      </p>
      <p class="item-text">
        2.3
        您明确了解并同意，全品AI教研云会员的付费方式为代收费运营商托收的付款方式，您通过此种付费方式付费可能存在一定的商业风险，包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动，该风险均会给您造成相应的经济损失。您应自行承担向侵权方追究侵权责任和追究责任不能的后果。
      </p>
      <p class="item-text">
        2.4
        您对本服务条款及修改有任何异议，可自动放弃其资格，但不退还任何已缴纳的会员服务费用。
      </p>
      <p class="item-text">
        2.5您有违反本协议任何行为，导致任何第三方损害的，您应当独立承担责任；全品AI教研云因此若遭受损失，您也应当一并赔偿。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        三、关于本服务
      </h3>
      <p class="item-text">
        3.1全品AI教研云会员服务，是全品AI教研云针对会员而开通的一项服务内容，会员在支付一定的费用后，即可在相应的时间内享受全品AI教研云为会员设置的服务项目，具体以相关服务页面公布、实际提供的内容为准。
      </p>
      <p class="item-text">
        3.2会员的增值服务资费标准以全品AI教研云网站上标注的详细资费标价为准，全品AI教研云有权基于自身业务发展需要变更上述资费标准，但全品AI教研云会根据实际运营情况对不同阶段已经激活且持续有效的会员给予续费、升级方面的不同资费优惠，具体优惠政策以全品AI教研云在相关服务页面公告的内容为准。
      </p>
      <p class="item-text">
        3.3
        武汉全品教育科技有限公司享有全品AI教研云产品的知识产权，无论产品处于何种环节均不能改变该产品的知识产权权属关系，用户购买服务后仅享有全品AI教研云产品的使用权，且仅限个人使用，不得用作任何商业用途。全品AI教研云的一切著作权、商标权、专利权、商业秘密等知识产权，包含的任何文字、图表、音频、视频或软件（包括但不限于本站中包含的图表、动画、音频、视频、界面设计、版面框架、数据和程序、代码、文档）等信息或材料均受著作权法、商标法、专利法或其它法律法规、国际条约的保护，未经相关权利人书面同意，用户不得以任何方式实施、使用或转让该等知识产权、信息或材料。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        四、用户个人信息保护
      </h3>
      <p class="item-text">
        4.1
        保护用户个人信息是全品AI教研云的一项基本原则，全品AI教研云将尽可能运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。
        4.2您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息，包括但不限于身份证号、邮箱、家庭住址等。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则可能无法使用本服务或在使用过程中受到限制。
      </p>
      <p class="item-text">
        4.3一般情况下，您可根据相关产品规则浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
      </p>
      <p class="item-text">
        4.4全品AI教研云不会将您的个人信息转移或披露给任何第三方，除非：
      </p>
      <p class="item-text">
        4.4.1相关法律法规或司法机关、行政机关要求。
      </p>
      <p class="item-text">
        4.4.2为完成合并、分立、收购或资产转让而转移。
      </p>
      <p class="item-text">
        4.4.3为提供您要求的服务所必需。
      </p>
      <p class="item-text">
        4.5全品AI教研云非常重视对未成年人个人信息的保护。若您不具备完全民事行为能力，在使用全品AI教研云的服务前，应事先取得您的监护人的同意。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        五、数据、信息和隐私保护
      </h3>
      <p class="item-text">
        5.1
        您认可在访问全品AI教研云过程中所产生并储存于全品AI教研云产品服务器中的任何数据信息（包括但不限于账号信息、使用记录等数据信息)，均属于相关程序在运行过程中产生的衍生数据，全品AI教研云对储存在其服务器中的上述数据信息拥有所有权，您在按照本协议约定正常访问全品AI教研云过程中对属于全品AI教研云账户的数据信息享有非独家的、有限的使用权。在法律允许范围内，全品AI教研云有权决定保留或不保留服务器上的全部或部分数据。本协议所述的数据和信息，即您访问全品AI教研云过程中产生的数据和信息。
      </p>
      <p class="item-text">
        5.2全品AI教研云将在法律允许的范围内将前述个人数据和信息用于如提升产品体验、进行个性化推荐等。全品AI教研云保证不对外公开，或向第三方透露您的个人数据信息，以及您在使用全品AI教研云服务时产生的非公开内容，但以下情形除外：
      </p>
      <p class="item-text">
        5.2.1全品AI教研云已获得您的明确授权；
      </p>
      <p class="item-text">
        5.2.2全品AI教研云为提升产品和服务质量；
      </p>
      <p class="item-text">
        5.2.3根据有关的法律法规要求，全品AI教研云负有披露义务的；
      </p>
      <p class="item-text">
        5.2.4司法机关或行政机关基于法定程序要求提供的；
      </p>
      <p class="item-text">
        5.2.5为维护社会公共利益以及全品AI教研云合法权益，在合理范围内进行披露的。
      </p>
      <p class="item-text">
        5.3
        为了不断提升和改善我们的服务，在法律允许范围内，全品AI教研云将根据产品及业务需求收集、使用或可能与第三方分享您的非个人信息，这将有助于全品AI教研云向您提供更好的体验和服务质量。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        六、购买及账户消费查询
      </h3>
      <p class="item-text">
        6.1
        费用支付：会员服务费用将在您点击购买之日按照会员服务上的标示价格通过支付宝、微信等第三方代收费的方式支付。
        6.2
        一旦您在全品AI教研云购买会员服务成功后，则全品AI教研云将即时收取该会员服务的费用，并不提供退费服务。
      </p>
      <p class="item-text">
        6.3
        您可以通过登录全品AI教研云个人中心查询您的账号信息详情，包括已开通的服务内容、服务期限、消费金额、交易状态等。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        七、用户权利与限制
      </h3>
      <p class="item-text">
        7.1
        会员为单学科会员，在有效期内可在全品AI教研云所购买的学科，无限制查看试题答案解析，每个自然月免费下载1000道试题，选题组卷或下载试卷，以及享有全品AI教研云为会员提供的其他权益。（备注：使用会员服务以外的其他资源需单独付费）
      </p>
      <p class="item-text">
        7.2
        在会员有效期内，会员可优先参加由全品AI教研云组织的活动并享有由全品AI教研云提供的各项优惠及增值服务。
      </p>
      <p class="item-text">
        7.3 对于您购买的会员服务，您只可以私人使用，不得用于商业、盈利等用途。
      </p>
      <p class="item-text">
        7.4
        您同意不会采用收费或免费的方式，全部或部分地在任何公开场合展示您购买的会员服务，除非您的上述行为不会构成侵权。
      </p>
      <p class="item-text">
        7.5 当您购买、使用会员服务时，禁止有下列情况发生：
      </p>
      <p class="item-text">
        7.5.1 用非法的方式或为了非法的目的使用已购买的会员服务；
      </p>
      <p class="item-text">
        7.5.2
        将您的全品AI教研云账户有偿或无偿提供给任何第三人，并允许他通过您的账户使用非其付费购买的会员服务。
      </p>
      <p class="item-text">
        7.5.3 将会员服务复制、销售、出租或授权给任何第三方。
      </p>
      <p class="item-text">
        7.5.4
        主动对全品AI教研云用于保护其会员服务的任何安全措施技术进行攻克、反向操作、更改、破坏或其他篡改，或协助他人进行上述行为。
      </p>
      <p class="item-text">
        7.5.5
        通过非全品AI教研云官方认可的方式获得会员许可，或者删除会员服务上的任何所有权声明或标签。
      </p>
      <p class="item-text">
        7.5.6 如出现以上任一情况，全品AI教研云系统将自动封禁该账号。
      </p>
      <p class="item-text">
        7.6
        您理解并同意全品AI教研云将会尽其商业上的合理努力保障您在服务中的数据存储安全，但是，全品AI教研云并不能就此提供完全保证，包括但不限于以下情形：
      </p>
      <p class="item-text">
        7.6.1全品AI教研云不对您在使用服务中相关数据的删除或储存失败负责；
      </p>
      <p class="item-text">
        7.6.2全品AI教研云有权根据实际情况在您知悉情况下保留在本软件及服务中的数据，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份服务中的相关数据；
      </p>
      <p class="item-text">
        7.6.3如果您停止使用服务或服务被终止或取消，全品AI教研云可以从服务器上永久地删除您的数据。服务停止、终止或取消后，账号信息将无法恢复或提供。
        您理解并同意，本服务是按照现有技术和条件所能达到的现状提供的。全品AI教研云会尽最大努力保障服务的连贯性和安全性，但不能随时预见和防范法律、技术以及其他风险，全品AI教研云对此类风险在法律允许的范围内免责，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。
      </p>
      <p class="item-text">
        7.7
        您理解并同意，若全品AI教研云认为或收到他人举报/投诉您违反了本用户协议，全品AI教研云可以对相关内容进行删除、屏蔽，并视行为情节对违规主体相关帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。
      </p>
      <p class="item-text">
        7.8您理解并同意，全品AI教研云可自行决定且无需提前通知，因下列原因终止您访问网站的权限，包括（但不限于）：（1）应政府部门和司法机关的要求；（2）本网站或本网站提供的任何服务的中止或重大修改；或（3）不可预期的技术问题。
        若因您违反本用户协议致使全品AI教研云对您提起法律诉讼，除法律授予全品AI教研云的任何其他救济外，全品AI教研云有权从您处获得且您同意支付所有合理的律师费及诉讼费用。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        八、变更及免责条款
      </h3>
      <p class="item-text">
        8.1
        全品AI教研云对会员服务的服务周期、购买价格保留随时变更的权利，而不需通知您。对于所有服务的中断或终止而造成的任何损失，全品AI教研云无需对您或任何第三方承担任何责任。
      </p>
      <p class="item-text">
        8.2
        鉴于网络服务的特殊性，您同意全品AI教研云有权随时变更、中断或终止部分或全部的网络服务。全品AI教研云保留随时修改或中断服务而不需通知您的权利，对于所有服务的中断或终止而造成的任何损失，全品AI教研云无需对您或任何第三方承担任何责任。
      </p>
      <p class="item-text">
        8.3
        对于因服务器的死机、网络的故障、数据库故障、软件升级、服务器维修、调整、升级等问题，或其他不可抗拒的事由，包括但不限于政府行为、自然灾害、黑客攻击等造成的服务中断和对您个人数据及资料造成的损失，全品AI教研云不承担由此对您造成的任何损失或退还任何已缴纳的会员服务费用。但全品AI教研云应尽可能事先进行通告。
      </p>
      <p class="item-text">
        8.4
        您购买的服务使用期限中包含解决故障、服务器维修、调整、升级等所需用的合理时间，对上述情况所需用的时间全品AI教研云不予补偿并保留解释权。
      </p>
      <p class="item-text">
        8.5
        全品AI教研云对任何直接、间接、偶然、特殊及继起的损害不负责任，不予赔偿。
      </p>
      <p class="item-text">
        8.6
        您在使用全品AI教研云所提供的服务时，如遭受任何人身或财务的损失、损害或伤害，不论原因如何，全品AI教研云均不负责任。由于您将个人密码告知他人或与他人共享注册账户，由此导致的任何个人资料泄露，本网站不负任何责任。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        九、中断及终止服务
      </h3>
      <p class="item-text">
        9.1
        因发生全品AI教研云不可抗拒的事由，如政府行为、不可抗力，导致会员服务无法继续，全品AI教研云会以最快的速度通知会员，但不承担由此对会员造成的任何损失并不退还会员服务费。
      </p>
      <p class="item-text">
        9.2
        如您违反本服务条款中的内容，全品AI教研云有权在不通知您的情况下立即终止您已购买的所有服务，以及取消您的全品AI教研云账户和使用权限，但不退还任何已缴纳的会员服务费用。
      </p>
    </div>
    <div class="section-item">
      <h3 class="item-title">
        十、其他
      </h3>
      <p class="item-text">
        10.1您使用本服务即视为您已阅读并同意受本协议的约束。
      </p>
      <p class="item-text">
        10.2本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
      </p>
      <p class="item-text">
        10.3
        如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向全品AI教研云主体所在地的人民法院提起诉讼。
      </p>
      <p class="item-text">
        10.4本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
      </p>
      <p class="item-text">
        10.5本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
      </p>
    </div>
  </div>
</template>

<script type="text/ecmascript-6">
export default {
  name: 'Agreement'
}
</script>

<style lang="scss" scoped rel="stylesheet/scss">
  @use "@/assets/css/variables" as *;
.top-nav {
  display: none;
}
.content-container {
  margin-top: 40px;
  margin-bottom: 50px;
  .sub-title {
    text-align: center;
    color: $color-text-d;
    font-size: 28px;
  }
  .theme-block {
    width: 30px;
    height: 3px;
    margin: 14px auto 20px;
    background: $color-theme;
  }
  .section-item {
    margin-bottom: 30px;
    .item-title {
      margin-bottom: 20px;
      color: $color-text-d;
      font-weight: 700;
      font-size: $font-size-large;
    }
    .item-text {
      line-height: 24px;
      margin-bottom: 15px;
      &.padding-10 {
        padding-left: 10px;
      }
      &.padding-30 {
        padding-left: 30px;
      }
      &.bottom-0 {
        margin-bottom: 0;
      }
    }
  }
}
</style>
